день = int(input('Введите день рождение:'))
месяц = int(input('Введите месяц рождения:'))

if месяц == 3 and день in range(21, 32) or месяц == 4 and день <= 20 and день >= 1:
    print('Овен')
elif месяц == 4 and день >= 21 and день <= 30 or месяц == 5 and день <= 21 and день >= 1:
    print('Телец')
elif месяц == 5 and день >= 22 and день <= 31 or месяц == 6 and день <= 21 and день >= 1:
    print('Близнецы')
elif месяц == 6 and день >= 22 and день <= 30 or месяц == 7 and день <= 22 and день >= 1:
    print('Рак')
elif месяц == 7 and день >= 23 and день <= 31 or месяц == 8 and день <= 21 and день >= 1:
    print('Лев')
elif месяц == 8 and день >= 22 and день <= 31 or месяц == 9 and день <= 23 and день >= 1:
    print('Дева')
elif месяц == 9 and день >= 24 and день <= 30 or месяц == 10 and день <= 23 and день >= 1:
    print('Весы')
elif месяц == 10 and день >= 24 and день <= 31 or месяц == 11 and день <= 22 and день >= 1:
    print('Скорпион')
elif месяц == 11 and день >= 23 and день <= 30 or месяц == 12 and день <= 22 and день >= 1:
    print('Стрелец')
elif месяц == 12 and день >= 23 and день <= 31 or месяц == 1 and день <= 20 and день >= 1:
    print('Козерог')
elif месяц == 1 and день >= 21 and день <= 31 or месяц == 2 and день <= 19 and день >= 1:
    print('Водолей')
elif месяц == 2 and день >= 20 and день <= 29 or месяц == 3 and день <= 20 and день >= 1:
    print('Рыбы')
else:
    print('Введите корректную дату')

